Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: This is determined by the state of this toolbar when Password Safe was last ended
ru_ru: Определяется состоянием панели поиска при последнем закрытии Password Safe

source: This is disabled if the database is opened read-only.
ru_ru: Пункт заблокирован, если контейнер открыт в режиме «только чтение».

source: This is done via the Manage->Yubikey... dialog box as described in the Manage Menu Section.
ru_ru: Требуемые действия выполняются в пункте меню «Сервис→YubiKey...» (описание доступно в разделе Сервис).

source: This is equivalent to selecting the "View → Filter → New/Edit Filter" menu entry.
ru_ru: Это равносильно выбору пункта меню Вид→Фильтры пользователя→Создать/Редактировать фильтр.

source: This is equivalent to selecting the View->Filter->New/Edit Filter menu entry.
ru_ru: Это равносильно выбору пункта меню «Просмотр»→«Фильтры»→«Создать/Редактировать фильтр».

source: This is followed by the Failsafe Backup file(s).
ru_ru: Затем идёт список доступных аварийных резервных копий.

source: This is the key that will be written to your backup YubiKey.
ru_ru: Этот ключ будет записан на резервный YubiKey.

source: This is the way Microsoft's HotKey processing works and is not a Password Safe restriction.
ru_ru: Это связано с особенностями обработки комбинаций горячих клавиш в ОС Windows и не является ограничением, внесённым Password Safe.

source: This is useful for cases where write permissions to the pwsafe.exe install directory are restricted (See also the description of the -g option in the Command Line Arguments Section) and in a "wrapper" script/batch file on a portable device (e.g., disk-on-key) by setting the configuration Folder/directory as needed.
ru_ru: Может пригодится если доступ к каталогу, в котором установлен pwsafe.exe ограничен (см. также описание параметра -g в разделе Параметры командной строки) или требуется запустить программу через скрипт-обёртку со сменного носителя.

source: This is useful for cases where write permissions to the pwsafe.exe install directory is restricted (See also the description of the -g option in the Command Line Arguments Section).
ru_ru: Может пригодится если доступ к каталогу, в котором установлен pwsafe.exe ограничен (см. также описание параметра -g в разделе Параметры командной строки).

source: This is useful for cases where write permissions to the pwsafe.exe install directory is restricted (See also the descrption of the -g option in the Command Line Arguments Section).
ru_ru: Может пригодится если доступ к каталогу, в который установлен pwsafe.exe ограничен (См. также ).

source: This is useful for cases where write permissions to the pwsafe.exe install directory is restricted.
ru_ru: Это может быть использовано в случае, если у пользователя нет прав на изменение файлов в каталоге установки pwsafe.exe.

source: This is useful for fine-tuning the timing with certain web pages.
ru_ru: Задержка может использоваться для тонкой настройки входа на некоторые веб-станицы.

source: This is useful for fixing and refining the filter based on the results.
ru_ru: Это удобно при исправлении и подстройке фильтров.

source: This is useful for sites that ask for parts of a password to login.
ru_ru: Данная функция может быть полезна для сайтов, требующих ввода части пароля.

source: This is useful if the alternate browser is a remote access application, e.g., an SSH client.
ru_ru: Это может потребоваться, если в качестве альтернативного браузера указан SSH-клиент или другое приложение для удалённого доступа.

source: This is useful if you don't recall the name of an entry, but have a good idea regarding the contents, e.g., the entry with "Mary" in the Notes.
ru_ru: Это удобно, если вы не помните имя элемента, но знаете, что в нём содержится, например, элемент, содержащий в заметках имя Маша.

source: This is useful if you have an entry that "belongs" under more than one group, but you don't wish to duplicate data.
ru_ru: Ярлыки удобно использовать если элемент «принадлежит» к нескольким группам, но вы не желаете дублировать данные.

source: This is useful if you wish to remove traces of Password Safe on your PC.
ru_ru: Данный функционал может быть использован для удаления следов Password Safe с вашего компьютера.

source: This is useful if you've a set of filters that you wish to share across several databases, without having to explicitly import them each time.
ru_ru: Это удобно, если нужно использовать некоторый набор фильтров во всех контейнерах, и нет желания загружать их вручную каждый раз.

source: This is useful in a "wrapper" script/batch file on a portable device (e.g., disk-on-key), setting the config dir as needed.
ru_ru: Параметр может пригодиться при написании скриптов для запуска с портативного устройства (например, флеш-накопителя).

source: This is useful to show compliance with password policies as required in some workplaces, and to revert to a previous password if a change did not take effect for some reason.
ru_ru: Это позволяет показать соответствие политикам создания паролей (что может быть необходимым в некоторых случаях), а также вернуться к предыдущему паролю, если по какой-либо причине смена пароля не удалась.

source: This is useful when you need a password that is both secure and relatively easy to remember without Password Safe.
ru_ru: Данная опция может быть удобна в случае, если требуется создать стойкий пароль, который легко запомнить без Password Safe.

source: This is useful, for example, if your default browser is Firefox, and you wish to access a website that works best with Internet Explorer, in which case you should specify the Internet Explorer as your alternate browser (typically "C:\Program Files\Internet Explorer\iexplorer.exe).
ru_ru: Данный функционал может потребоваться, например, если в качестве браузера по умолчанию настроен Firefox, а связанный с элементом сайт лучше работает в Internet Explorer. В этом случае необходимо указать Internet Explorer как альтернативный браузер («C:\Program Files\Internet Explorer\iexplorer.exe»).

source: This is useful, for example, if your default browser is Firefox, and you wish to access a website that works best with Internet Explorer.
ru_ru: Данный функционал может потребоваться, например, если в качестве браузера по умолчанию настроен Firefox, а связанный с элементом сайт лучше работает в Internet Explorer.

source: This item will only appear for a shortcut or alias entry.
ru_ru: Данный пункт отображается только для ярлыков и псевдонимов.

source: This keyboard is then used to simulate all available foreign characters.
ru_ru: Она может быть использована для всех иностранных алфавитов.

source: This line is generated automatically by the "Export Text" function, but must be added manually for files created from other tools.
ru_ru: Эта строка создаётся автоматически при экспорте в текст. Для файлов, созданных вручную (или с помощью других утилит), её нужно заполнить или отредактировать в соответствии с форматом.

source: This makes it more difficult for malicious software to intercept the user input.
ru_ru: Усложнение перехвата пароля вредоносными программами обеспечивается благодаря использованию дополнительных механизмов изоляции приложений.

source: This may be keyboard dependent.
ru_ru: Может зависеть от клавиатуры.

source: This may be useful in a multi-user environment, as by default Password Safe allows write access to the first person who opens the database, and restricts others to read-only mode.
ru_ru: Данная настройка может пригодиться, если контейнером пользуются несколько людей, так как по умолчанию Password Safe разрешает запись первому, открывшему контейнер, и блокирует изменения для остальных.

source: This may cause issues when executed as CR and/or LF will be taken as 'enter'.
ru_ru: Это может привести к ситуации когда CR и/или LF будут расценены как нажатие клавиши «Enter».

source: This may make some key combinations unavailable on some keyboards.
ru_ru: Поэтому, на некоторых клавиатурах часть комбинаций клавиш может быть недоступна.

source: This means that undo/redo of pre-lock changes will not be available upon unlock.
ru_ru: По этой причине после разблокировки контейнера недоступен откат действий, произведённых до блокировки.

source: This means that when you click on them, the current contents of the relevant field are copied to the clipboard.
ru_ru: При щелчке на них значение соответствующего поля копируется в буфер обмена.

source: This means that you are responsible for making the master key available to others under the appropriate circumstances.
ru_ru: Поэтому, при наступлении такой ситуации, вам придётся самостоятельно обеспечить доступ доверенным лицам к мастер-паролю.

source: This means you may be prompted to save the database upon exit, even though you didn't explicitly change anything.
ru_ru: Поэтому, при закрытии контейнера вам будет предложено сохранить изменения, даже если вы ничего явно не изменяли.

source: This mechanism may handle non-Latin characters incorrectly, but can make AutoType work on certain problematical web sites.
ru_ru: В данном случае нелатинские символы могут вводиться некорректно, но также может улучшиться работа автонабора на некоторых проблемных веб-сайтах.

source: This mechanism may handle non-Latin characters incorrectly, but can make Autotype work on certain problematical web sites.
ru_ru: В данном случае нелатинские символы могут вводиться некорректно, но также может улучшиться работа автонабора на некоторых проблемных веб-сайтах.

source: This menu also replaces the setting of the database defaults via the "Manage → Options" menu item.
ru_ru: Данный пункт меню также заменяет настройки политики по умолчанию, которые раньше задавались через «Сервис→Настройки».

source: This operation will create an unprotected copy of the passwords in the database.
ru_ru: Эта операция приводит к созданию незащищённой копии указанных элементов.

source: This option allows you to configure how many recent entries you wish to keep in the system tray icon's list.
ru_ru: Данная опция позволяет задать количество элементов, сохраняемых в этом списке.

source: This option determines how the recently opened databases are presented in the File menu - directly on the menu, or as a sub-menu.
ru_ru: Данная настройка управляет расположением списка недавно использованных контейнеров (внутри самого меню «Файл» или в подменю).

source: This option is useful, for example, if you wish to change the delays for all entries.
ru_ru: Например, данную настройку можно использовать для изменения задержки автонабора всех элементов.

source: This option opens a dialog box showing the version number and copyright notice, as well as letting you check if there's a newer version of Password Safe available.
ru_ru: Данный пункт меню отображает окно с информацией о версии и лицензии на распространение исходного кода. Также здесь вы можете проверить наличие новых версий Password Safe.

source: This option specifies if recent passwords are stored by default for new entries.
ru_ru: Данная настройка указывает, нужно ли по умолчанию включать сохранение предыдущих паролей для новых элементов.

source: This page describes the current format.
ru_ru: Здесь описывается текущий формат.

source: This policy can be overridden temporarily and passwords manually edited at any time in the Edit/View Entry dialog.
ru_ru: Данная политика и пароль могут быть переопределены в диалоге редактирования/просмотра элемента.

source: This prevents anyone else or any other program from reading the contents of the clipboard.
ru_ru: В этом случае никто не сможет прочитать то, что было записано в буфер.

source: This report may be copied to the clipboard or saved to disk as a text file in the same directory as the database.
ru_ru: Содержимое отчёта может быть скопировано в буфер обмена или сохранено на диск в том же каталоге, где находится контейнер.

source: This section allows you to modify the password history tracking of existing entries, as follows:
ru_ru: Данный раздел позволяет управлять настройками ведения истории паролей для уже созданных элементов:

source: This section describes how to define and use such aliases.
ru_ru: Этот раздел описывает порядок определения и использования псевдонимов.

source: This section describes how to manually make backups of your password database Password Safe can also be configured to make automatic backups of your database whenever the database is saved.
ru_ru: В данном разделе описываются методы ручного создания резервных копий. Также в Password Safe можно настроить автоматическое создание резервных копий при сохранении контейнера.

source: This section describes how to manually make backups of your password database Password Safe can also be configured to makeautomatic backups of your database whenever the database is saved.
ru_ru: В данном разделе описываются методы ручного создания резервных копий. Также в Password Safe можно настроить автоматическое создание резервных копий при сохранении контейнера.

source: This section describes how to manually make backups of your password database. Password Safe can also be configured to make automatic backups of your database whenever the database is saved.
ru_ru: В данном разделе описываются методы ручного создания резервных копий. Также можно настроить Password Safe таким образом, чтобы резервные копии создавались автоматически при сохранении контейнера.

source: This section of the file menu may list the recently opened database files.
ru_ru: Данное подменю может содержать список недавно использованных контейнеров.

source: This section will be blank if this is the first time Password Safe has been used.
ru_ru: Подменю может быть пустым, если Password Safe запускается в первый раз.

source: This tab allows you to control and review the shortcuts, as follows.
ru_ru: Здесь вы можете управлять назначением клавиатурных комбинаций.

source: This table summarizes the shortcuts that are associated with specific entries in the currently opened database.
ru_ru: В данной таблице указаны горячие клавиши, связанные с элементами текущего контейнера.

source: This variable can appear anywhere in the Run Command as it only specifies what Password Safe will do after the command string has been executed.
ru_ru: Данная переменная может быть написана в любом месте поля «Выполнить», так как она указывает, что должен сделать Password Safe после выполнения команды.

source: This will be created in the same directory as the currently open database.
ru_ru: Файл создаётся в том же каталоге, где находится текущий открытый контейнер.

source: This will cause a new expiration date to be calculated based on the specified number of days and when you change the entry's password.
ru_ru: Тогда при смене пароля новая дата истечения будет рассчитана автоматически.

source: This will cause the application to read and write preferences under the specified hostname, instead of under the machine's name.
ru_ru: При запуске, вместо настроек для текущей машины, Password Safe будет использовать настройки, указанные для имя_хоста.

source: This will cause the application to read and write preferences under the specified username, instead of under the login name.
ru_ru: При запуске, вместо настроек пользователя, вошедшего в систему, будут использоваться настройки, заданные для пользователя имя_пользователя.

source: This will cause the specified file to be used for loading and storing preferences, instead of the default pwsafe.cfg.
ru_ru: В данном случае указанный файл будет использован для загрузки и сохранения настроек (вместо файла по умолчанию «pwsafe.cfg»).

source: This will create a 20 byte random secret key that will be written to your YubiKey, and used to access your database.
ru_ru: Будет сгенерирована 20-байтная случайная последовательность, которая затем будет записана в YubiKey и использована при доступе к контейнеру.

source: This will delete the selected Failsafe Backup file.
ru_ru: Выбранная аварийная резервная копия будет удалена.

source: This will display the corresponding entry's Edit dialog box.
ru_ru: Будет открыт диалог редактирования элемента.

source: This will display the following Wizard page:
ru_ru: На следующей странице мастера будет отображён диалог:

source: This will display the following dialog box:
ru_ru: На следующей странице будет отображён диалог:

source: This will execute the command in the field Run Cmd of the selected entry.
ru_ru: Запуск команды, указанной в поле Выполнить текущего элемента.

source: This will help safeguard password lists against system crashes or corrupted files.
ru_ru: Этот поможет избежать потери списка паролей в случае системного сбоя или повреждения файлов.

source: This will not be the case if an entry is dragged within the same database.
ru_ru: При перетаскивании внутри текущего контейнера этого не произойдёт.

source: This will open a new instance of Password Safe with the specified database (Thanks to Dave for this one):
ru_ru: Открытие указанного контейнера в новом экземпляре Password Safe (спасибо Дейву (Dave) за пример):

source: This will open the specified database file, instead of the last one opened.
ru_ru: Будет открыт указанный в параметре файл вместо того, что использовался в прошлый раз.

source: This will open the specified database in read-only mode.
ru_ru: Указанный контейнер будет открыт в режиме «только чтение».

source: This will prevent Password Safe validating databases automatically when they are opened.
ru_ru: Не использовать автоматическую проверку целостности при открытии контейнера.

source: This will prompt the user for a passphrase, and decrypt the file with a key derived from the passphrase.
ru_ru: Указанный файл будет расшифрован с использованием ключа, полученного из введённого пароля.

source: This will prompt the user for a passphrase, and encrypt the file with a key derived from the passphrase.
ru_ru: Указанный файл будет зашифрован с использованием ключа, полученного из введённого пароля.

source: This will write the generated key to your YubiKey, and save the data in encrypted form in your Password Safe database, so that you can use it to configure a backup key.
ru_ru: При выполнении этого действия созданный ключ будет записан в YubiKey, а его зашифрованная копия в контейнер Password Safe (чтобы его затем можно было использовать при создании резервной копии).

source: This will write the generated key to your backup YubiKey.
ru_ru: Произойдёт сохранение ключа на резервное устройство.

source: This window allows you to do this in a convenient manner: In the upper field you enter the positions of the password characters you want for the subset of the password.
ru_ru: В верхнем поле нужно указать позиции необходимых символов.

source: This works fine for most web sites that require username/password authentication.
ru_ru: Данная схема подходит для большинства сайтов, требующих аутентификацию по имени пользователя и паролю.

source: Those stored in the database apply only to that database.
ru_ru: Настройки, сохраняемые в контейнере, применяются только к нему.

source: Those stored in the database apply only to that particular database.
ru_ru: Настройки, сохраняемые в контейнере, применяются только к нему.

source: Threshold in minutes to determine whether to lock Password Safe due to inactivity
ru_ru: Время простоя, по истечении которого Password Safe будет блокироваться (если включено)

source: Through the Edit Menu you can add, edit, use and organize user names and passwords.
ru_ru: Используя меню Правка вы можете добавлять, редактировать, использовать и упорядочивать имена пользователей и пароли.

source: Time fields can be one of the following 5 formats:
ru_ru: Время может быть указано в одном из 5 форматов:

source: Time fields can be one of the following 7 formats:
ru_ru: Время может быть указано в одном из 7 форматов:

source: Title
ru_ru: Заголовок

source: To Password Safe, it functions as an authentication token, providing strong physical security to the password database.
ru_ru: Для Password Safe он выступает как маркер аутентификации (токен), добавляющий привязку к физическому устройству для защиты контейнера.

source: To add a new filter, click on New.
ru_ru: Для добавления нового фильтра нажмите кнопку «Создать».

source: To apply an existing filter, click on the Apply checkbox in the desired filter's row.
ru_ru: Для применения существующего фильтра нужно установить для него флажок в столбце «Применить».

source: To cancel the expiration, click on "Clear".
ru_ru: Чтобы прекратить использование срока действия пароля нажмите кнопку «Очистить».

source: To cancel the expiration, select "None".
ru_ru: Чтобы прекратить использование срока действия пароля выберите «Нет».

source: To change a master password ("Safe Combination"), first open up the database whose password you wish to change.
ru_ru: Для изменения мастер-пароля откройте контейнер, пароль которого требуется изменить.

source: To change a shortcut (or add a new one), select the row with the action you'd like to change, then click on the 'Shortcut Key' field fo that entry.
ru_ru: Чтобы изменить или задать комбинацию клавиш, выберите строку с необходимым действием и щёлкните в поле «Комбинация...».

source: To change a shortcut (or add a new one), select the row with the action you'd like to change, then click on the 'Shortcut Key' field for that entry.
ru_ru: Чтобы изменить или задать комбинацию клавиш, выберите строку с необходимым действием и щёлкните в поле «Комбинация...».

source: To change from one to another:
ru_ru: Для переключения между этими режимами:

source: To change the PasswordSafe database so that it is only protected by a master password:
ru_ru: Для того, чтобы изменить параметры аутентификации при доступе к контейнеру на использование только мастер-пароля:

source: To change your master password, please see Changing Master Passwords.
ru_ru: Порядок изменения мастер-пароля описан в разделе Изменение мастер-пароля для контейнера.

source: To clear the search text, click on the eraser button.
ru_ru: Для очистки поля с искомым текстом нажмите кнопку, на которой изображён ластик.

source: To close the Find toolbar, click on the 'x' to the left of the text.
ru_ru: Для закрытия панели поиска нужно нажать на «x» слева от поля ввода.

source: To configure an alternate browser, use the Manage->Options->Misc. dialog box.
ru_ru: Настройка параметров альтернативного браузера производится на вкладке Управление→Настройки→Разное.

source: To configure an alternate browser, use the "Manage → Options → Misc." dialog box.
ru_ru: Настройка параметров альтернативного браузера производится на вкладке Сервис→Настройки→Разное.

source: To convert a Password Safe database that is accessed using a Master Password (Safe Combination) to YubiKey access:
ru_ru: Чтобы изменить способ аутентификации при доступе к контейнеру Password Safe с мастер-пароля на YubiKey:

source: To create a backup YubiKey
ru_ru: Создание резервной копии YubiKey

source: To create a report about your searching results, press the symbol.
ru_ru: Для создания отчёта о найденных элементах щёлкните по значку .

source: To customize your YubiKey
ru_ru: Для настройки YubiKey

source: To define a new filter, select the "View → Filter → New/Edit Filter" menu entry.
ru_ru: Для создания нового фильтра выберите пункт меню Вид→Фильтры пользователя→Создать/Редактировать фильтр.

source: To define a new filter, select the View->Filter->New/Edit Filter menu entry.
ru_ru: Для создания нового фильтра выберите пункт меню «Просмотр»→«Фильтры»→«Создать/Редактировать фильтр».

source: To display or hide the Dragbar, check or uncheck the Dragbar Visible menu item.
ru_ru: Для того, чтобы скрыть или показать панель «Dragbar» поставьте или снимите отметку на пункте меню Панель Dragbar.
